src/main/java/com/humber/demo/soapxmls/SOAP_XML_22.06.08.20.43.33.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://service.demo.humber.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <ser:getPatientsList/>
   </soapenv:Body></soapenv:Envelope><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Body><ns2:getPatientsListResponse xmlns:ns2="http://service.demo.humber.com/"><return><patientsList><name>patient1</name><disease>disease1</disease><dateOfBirth>1975-06-04T00:00:00-04:00</dateOfBirth></patientsList><patientsList><name>patient2</name><disease>disease2</disease><dateOfBirth>1979-08-10T00:00:00-04:00</dateOfBirth></patientsList><patientsList><name>patient3</name><disease>new disease</disease><dateOfBirth>2000-09-10T00:00:00-04:00</dateOfBirth></patientsList><patientsList><name>Jatinder</name><disease>Cold</disease><dateOfBirth>1993-07-26T00:00:00-04:00</dateOfBirth></patientsList></return></ns2:getPatientsListResponse></soap:Body></soap:Envelope>